ci4/app/Controllers/Post.php

    public function index()
    {
        $model = new ArtikelModel();
        $data = $model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `artikel`
ORDER BY `id` DESC

    public function update($id = null)
    {
        $model = new ArtikelModel();
        $artikel = $model->find($id);

        if (!$artikel) {
            return $this->failNotFound('Data tidak ditemukan');
        }

        $data = [
            'judul'  => $this->request->getVar('judul')  ?? $artikel['judul'],
            'isi'    => $this->request->getVar('isi')    ?? $artikel['isi'],
            'status' => $this->request->getVar('status') ?? $artikel['status']
        ];

        $model->update($id, $data);
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '19'
UPDATE `artikel` SET `judul` = 'hallo semuanya', `isi` = 'apakah sehat?sekarang ini mata kuliah web 2, jangan lupa loh\r\n\r\n', `status` = '1', `updated_at` = '2026-06-14 23:54:28'
WHERE `artikel`.`id` IN ('19')

    public function delete($id = null)
    {
        $model = new ArtikelModel();
        $artikel = $model->find($id);

        if (!$artikel) {
            return $this->failNotFound('Data tidak ditemukan');
        }

        $model->delete($id);
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '18'
DELETE FROM `artikel`
WHERE `id` IN ('18')